Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
#1-pd.DataFrame
d={
    'key1':[3,4,5,6,1],
    'key2':[7,8,9,0,9],
    'key3':[2,4,5,7,8]
}
df=pd.DataFrame(d)
df

   key1  key2  key3
0     3     7     2
1     4     8     4
2     5     9     5
3     6     0     7
4     1     9     8

In [3]:
#2-df.set_index()
df.set_index('key1')

      key2  key3
key1
3        7     2
4        8     4
5        9     5
6        0     7
1        9     8

In [4]:
#3-sort_values()
df.sort_values('key2')

   key1  key2  key3
3     6     0     7
0     3     7     2
1     4     8     4
2     5     9     5
4     1     9     8

In [5]:
#4-windowing function
df['key1'].rolling(window=1).mean()

0    3.0
1    4.0
2    5.0
3    6.0
4    1.0
Name: key1, dtype: float64

In [6]:
#5-date function
date= pd.date_range(start="2023-04-23", end="2023-06-23")
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
data={'A':[1,2,3,3,4,5,6],'B':[4,5,6,5,6,7,4],'C':[7,8,9,5,6,7,6]}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
3  3  5  5
4  4  6  6
5  5  7  7
6  6  4  6

In [10]:
l=[1,3,5,7,9,11,13]

In [11]:
df.reindex(l)

      A    B    C
1   2.0  5.0  8.0
3   3.0  5.0  5.0
5   5.0  7.0  7.0
7   NaN  NaN  NaN
9   NaN  NaN  NaN
11  NaN  NaN  NaN
13  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [12]:
df1=pd.DataFrame({'Values':[10,20,30,40,50]})

In [13]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [14]:
df1['Values'][0:3].sum()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
text={"text":["i am a data science student","i am aspirinig to upskill and get ahead in my career"]}

In [16]:
df2=pd.DataFrame(text)

In [17]:
df2

                                                text
0                        i am a data science student
1  i am aspirinig to upskill and get ahead in my ...

In [18]:
df2['WORD_COUNT']=df2['text'].apply(lambda x : len(x.split()))

In [19]:
df2

                                                text  WORD_COUNT
0                        i am a data science student           6
1  i am aspirinig to upskill and get ahead in my ...          11

Q5. How are DataFrame.size() and DataFrame.shape() different?

ANSWER- 
df.size= it is used to get an int representing the number of elements in this object and Return the number of rows if Series. 

df.shape= it is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Q6. Which function of pandas do we use to read an excel file?

ANSWER- pd.read_excel("EXCEL_FILE")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [21]:
email={"Email":['chaikin@mac.com','hyper@optonline.net','subir@hotmail.com','hikoza@yahoo.ca','weazelman@mac.com','fwiles@yahoo.ca']}

In [22]:
df4=pd.DataFrame(email)

In [23]:
df4

                 Email
0      chaikin@mac.com
1  hyper@optonline.net
2    subir@hotmail.com
3      hikoza@yahoo.ca
4    weazelman@mac.com
5      fwiles@yahoo.ca

In [24]:
def Split(x):
    return x.split("@")

In [25]:
df4['Username']=df4['Email'].apply(lambda x: Split(x)[0])

In [26]:
df4

                 Email   Username
0      chaikin@mac.com    chaikin
1  hyper@optonline.net      hyper
2    subir@hotmail.com      subir
3      hikoza@yahoo.ca     hikoza
4    weazelman@mac.com  weazelman
5      fwiles@yahoo.ca     fwiles

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [27]:
df5=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [28]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [29]:
df6=df5[(df5["A"]> 5)&(df5["B"]<10)]

In [30]:
df6

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [31]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [32]:
df1.mean()

Values    30.0
dtype: float64

In [34]:
df1.median()

Values    30.0
dtype: float64

In [35]:
df1.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [56]:
df7=pd.DataFrame({"Sales":[10,40,50,40,10,90,50],
              "Date":pd.date_range(start="2023-04-20", end="2023-04-26")})

In [57]:
df7

   Sales       Date
0     10 2023-04-20
1     40 2023-04-21
2     50 2023-04-22
3     40 2023-04-23
4     10 2023-04-24
5     90 2023-04-25
6     50 2023-04-26

In [58]:
df7["MovingAverage"]=df7['Sales'].rolling(window=7).mean()

In [59]:
df7

   Sales       Date  MovingAverage
0     10 2023-04-20            NaN
1     40 2023-04-21            NaN
2     50 2023-04-22            NaN
3     40 2023-04-23            NaN
4     10 2023-04-24            NaN
5     90 2023-04-25            NaN
6     50 2023-04-26      41.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [60]:
df8=pd.DataFrame({"Date":pd.date_range(start="2023-04-20", end="2023-04-26")})

In [61]:
df8

        Date
0 2023-04-20
1 2023-04-21
2 2023-04-22
3 2023-04-23
4 2023-04-24
5 2023-04-25
6 2023-04-26

In [67]:
df8["Weekday"]=df8['Date'].dt.day_name()

In [68]:
df8

        Date    Weekday
0 2023-04-20   Thursday
1 2023-04-21     Friday
2 2023-04-22   Saturday
3 2023-04-23     Sunday
4 2023-04-24     Monday
5 2023-04-25    Tuesday
6 2023-04-26  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [70]:
df9=pd.DataFrame({"Date":pd.date_range(start="2023-01-01", end="2023-02-26")})

In [77]:
df9['Date'] = df9['Date'].apply(lambda x: pd.Timestamp(x))

In [78]:
df9

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10
41 2023-02-11
42 2023-02-12
43 2023-02-13
44 2023-02-14
45 2023-02-15
46 2023-02-16
47 2023-02-17
48 2023-02-18
49 2023-02-19
50 2023-02-20
51 2023-02-21
52 2023-02-22
53 2023-02-23
54 2023-02-24
55 2023-02-25
56 2023-02-26

In [89]:
df9[df9["Date"].isin(pd.date_range("2023-01-01", "2023-01-31"))]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Answer- Pandas , Numpy